.include "m16def.inc"

.cseg
.org 0x0000
    rjmp RESET

RESET:
    ; Αρχικοποίηση Stack Pointer 
    ldi r16, high(RAMEND)
    out SPH, r16
    ldi r16, low(RAMEND)
    out SPL, r16

    ; α) Αποθήκευση αριθμών 0-255 με φθίνουσα σειρά στη μνήμη (0x0200)
    ; =========================================================================
    ldi XL, low(0x0200)   ; Αρχικοποίηση του X στη διεύθυνση 0200H
    ldi XH, high(0x0200)
    
    clr R20               ; Ο R20 θα χρησιμοποιηθεί ως μετρητής για 256 επαναλήψεις 
                          ; (ξεκινάει από 0, με το dec πάει 255, 254 και κάτω μέχρι να ξαναγίνει 0)
    ldi R17, 255          ; Η πρώτη τιμή 

Store_Loop:
    st X+, R17            ; Αποθήκευση της τιμής του R17 στη μνήμη και αύξηση του δείκτη X
    dec R17               ; Μείωση της τιμής κατά 1
    dec R20               ; Μείωση του μετρητή βρόχου
    brne Store_Loop       

    ; β) Υπολογισμός bits που είναι 0 στα 256 δεδομένα
    ; =========================================================================
    ldi XL, low(0x0200)   ; Επαναφορά του X στην αρχή 
    ldi XH, high(0x0200)
    
    clr R14               
    clr R15              
    clr R20               

Count_Zeros_Outer:
    ld R17, X+            ; Φόρτωση ενός byte από την μνήμη στον R17
    ldi R19, 8            ; Μετρητής για τα 8 bits (εσωτερικός βρόχος)

Count_Zeros_Inner:
    lsr R17               ; Ολίσθηση δεξιά. Το LSB μπαίνει στο Carry flag (C)
    brcs Bit_Is_One       ; Αν C=1 (δηλαδή το bit ήταν 1) branch στο Bit_Is_One
    
    ; Αν φτάσουμε εδώ, το bit ήταν 0, άρα αυξάνουμε τον 16-bit μετρητή 
    inc R14
    brne Bit_Is_One       ; Αν ο R14 δεν υπερχείλισε, προσπέρασε τον R15
    inc R15               ; Διαφορετικά, αύξησε και το υψηλό byte (R15)

Bit_Is_One:
    dec R19               ; Μείωση του μετρητή των bits
    brne Count_Zeros_Inner; Αν δεν ελέγξαμε και τα 8 bits, συνέχισε τον εσωτερικό βρόχο
    
    dec R20               ; Μείωση του μετρητή των bytes
    brne Count_Zeros_Outer; Αν δεν διαβάσαμε και τα 256 bytes, συνέχισε τον εξωτερικό βρόχο

    ; (γ) Πλήθος αριθμών στο διάστημα [10H, 80H]
    ; =========================================================================
    ldi XL, low(0x0200)   ; Επαναφορά του X στην αρχή των δεδομένων
    ldi XH, high(0x0200)
    
    clr R16               
    clr R20               ; Επαναφορά μετρητή 

Count_Range_Loop:
    ld R17, X+            ; Φόρτωση στον R17
    
    cpi R17, 0x10         ; Σύγκριση με το κάτω όριο (10H)
    brlo Skip_Value       ; BRLO (Branch if Lower): Αν R17 < 10H, προσπέρασε
    
    cpi R17, 0x81         ; Σύγκριση με το άνω όριο + 1 (81H)
    brsh Skip_Value       ; BRSH (Branch if Same or Higher): Αν R17 >= 81H, προσπέρασε
    
    ; Αν φτάσουμε εδώ, 10H <= R17 <= 80H
    inc R16               ; Αύξηση μετρητή

Skip_Value:
    dec R20               ; Μείωση του μετρητή των 256 επαναλήψεων
    brne Count_Range_Loop ; Αν δεν τελειώσαμε loop


    ; Τερματισμός

End_Program:
    rjmp End_Program      ; Ατέρμονος βρόχος
